semestr1/logika/07.01.2021-wnioskowania.md

# Table of Contents

1.  [Wnioskowanie :: proces myślowy, którym na podstawie mniej lub bardziej stanowczego uznania przesłanek dochodzimy do uznania wniosku, którego bądź dotychczas nie uznawaliśmy wcale bądź uznawaliśmy mniej stanowczo, przy czym stopień stanowczości uznania wniosku nie przewyższa stopnia uznania przesłanek](#orgd61d3f3)
2.  [Wnioskowanie :: rozumowanie, w którym na podstawie pewnych przekonań uznanych za prawdziwe ochodzimy do jakiegoś innego przekonania](#org29045ce)
3.  [wnioskowanie jest **prawidłowe** jeżeli przebiega zgodnie ze schematem będocym tautologią](#org69d2b8f)
4.  [wnioskowanie w którym  wniosek wynika logicznie z przesłanek nazywamy wnioskowaniem dedukcyjnym](#orgf98bbec)
5.  [P -> W , (P1 ^ P2 ^ &#x2026; ^ Pn) -> W](#orgd638749)
6.  [wnioskowania](#org39a57d2)
    1.  [niezawodne](#orga429ef1)
        1.  [dedukcja :: prawdziwośc przesłanek gwarantuje prawdziwość wniosku](#orgb5c752d)
        2.  [indukcja enumeracyjna zupełna :: takie wnioskowanie, w którym twierdzenie ogólne wyprowadza się z przesłanek stwierdzających jego poszczególne przypadki oraz z przesłanki głoszącej, że przypadki te są wszystkimi możliwymi przypadkami (ta metoda jest jałowa, tzn. mało daje?)](#orgb56b1e3)
    2.  [uprawdopodapniające/probabilistyczne](#orgb3c5d3c)
        1.  [indukcja enumeracyjna niezupełna ::](#orgf388ab3)
        2.  [indukcja eliminacyjna (kanony Milla)](#org3f75b07)
        3.  [wniskowania z analogii](#orgec26b85)

Ajdukiewicz


<a id="orgd61d3f3"></a>

# Wnioskowanie :: proces myślowy, którym na podstawie mniej lub bardziej stanowczego uznania przesłanek dochodzimy do uznania wniosku, którego bądź dotychczas nie uznawaliśmy wcale bądź uznawaliśmy mniej stanowczo, przy czym stopień stanowczości uznania wniosku nie przewyższa stopnia uznania przesłanek


<a id="org29045ce"></a>

# Wnioskowanie :: rozumowanie, w którym na podstawie pewnych przekonań uznanych za prawdziwe ochodzimy do jakiegoś innego przekonania


<a id="org69d2b8f"></a>

# wnioskowanie jest **prawidłowe** jeżeli przebiega zgodnie ze schematem będocym tautologią


<a id="orgf98bbec"></a>

# wnioskowanie w którym  wniosek wynika logicznie z przesłanek nazywamy wnioskowaniem dedukcyjnym


<a id="orgd638749"></a>

# P -> W , (P1 ^ P2 ^ &#x2026; ^ Pn) -> W


<a id="org39a57d2"></a>

# wnioskowania


<a id="orga429ef1"></a>

## niezawodne


<a id="orgb5c752d"></a>

### dedukcja :: prawdziwośc przesłanek gwarantuje prawdziwość wniosku


<a id="orgb56b1e3"></a>

### indukcja enumeracyjna zupełna :: takie wnioskowanie, w którym twierdzenie ogólne wyprowadza się z przesłanek stwierdzających jego poszczególne przypadki oraz z przesłanki głoszącej, że przypadki te są wszystkimi możliwymi przypadkami (ta metoda jest jałowa, tzn. mało daje?)


<a id="orgb3c5d3c"></a>

## uprawdopodapniające/probabilistyczne


<a id="orgf388ab3"></a>

### indukcja enumeracyjna niezupełna ::


<a id="org3f75b07"></a>

### indukcja eliminacyjna (kanony Milla)


<a id="orgec26b85"></a>

### wniskowania z analogii

